status/2021/09apr21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>03 April 2021 - 09 April 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">03 April 2021 - 09 April 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb5c0c23">1. Santa Cruz Weather Station</a></li>
<li><a href="#org3338195">2. EPICS</a></li>
<li><a href="#org3fa02c2">3. Brini Tracker II</a></li>
<li><a href="#org891f62c">4. wktcolor</a></li>
<li><a href="#orgcbf991e">5. ca-r</a></li>
<li><a href="#org191da65">6. AMDGPU</a></li>
</ul>
</div>
</div>
<p>
Got Frustration?
</p>

<div id="outline-container-orgb5c0c23" class="outline-2">
<h2 id="orgb5c0c23"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Mast sensors still broken
</p>
</div>
</div>
<div id="outline-container-org3338195" class="outline-2">
<h2 id="org3338195"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
<p>
no progress
</p>
</div>
</div>
<div id="outline-container-org3fa02c2" class="outline-2">
<h2 id="org3fa02c2"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
Buttons still work after twelve weeks week of runtime. GPS display
update seems to be intermittent but is not working at this moment.
</p>
</div>
</div>
<div id="outline-container-org891f62c" class="outline-2">
<h2 id="org891f62c"><span class="section-number-2">4.</span> wktcolor</h2>
<div class="outline-text-2" id="text-4">
<p>
Use wktlib (from wktplot); wkt header needs c++ guard. Need a
strategy to make unique vertices fro constructing faces.
</p>
</div>
</div>
<div id="outline-container-orgcbf991e" class="outline-2">
<h2 id="orgcbf991e"><span class="section-number-2">5.</span> ca-r</h2>
<div class="outline-text-2" id="text-5">
<p>
data file has returned, quality unknown. The data description page
indicates that there are known problems.
</p>
</div>
</div>
<div id="outline-container-org191da65" class="outline-2">
<h2 id="org191da65"><span class="section-number-2">6.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-6">
<p>
Started looking at AMD GPU programming after a five year
hiatus. Still trying to get a working openmp toolchain. Updated
kmtrun which now compiles, but it fails at runtime to initialize a
work queue.  Tried building tools with GCC, LLVM/Clang, AMD AOMP,
and using AMD RPMs directly, and all show major problems of one sort
or another. Frustrating. Is this why NVidia is ahead GPU-wise?
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
